vanvught/GD32F407RE-DMX512-RDM/lib-ws28xx/src/gpio/ws28xxmulti.cpp
/**
 * @file ws28xxmulti.cpp
 *
 */
/* Copyright (C) 2021-2023 by Arjan van Vught mailto:info@gd32-dmx.org
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:

 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */

#pragma GCC push_options
#pragma GCC optimize ("O3")
#pragma GCC optimize ("-funroll-loops")
#pragma GCC optimize ("-fprefetch-loop-arrays")

#include <cstdint>
#include <cstring>
#include <cstdio>
#include <cassert>

#include "ws28xxmulti.h"
#include "pixelconfiguration.h"
#include "pixeltype.h"
#include "gpio/pixelmulti_config.h"

#include "gd32.h"

#include "debug.h"

#if defined (GD32F4XX)
// DMA
# define DMA_PARAMETER_STRUCT				dma_single_data_parameter_struct
# define DMA_CHMADDR						DMA_CHM0ADDR
# define DMA_MEMORY_TO_PERIPHERAL			DMA_MEMORY_TO_PERIPH
# define dma_init							dma_single_data_mode_init
# define dma_struct_para_init				dma_single_data_para_struct_init
# define dma_memory_to_memory_disable(x,y)
// GPIO
# define GPIOx_OCTL_OFFSET					0x14U;
# define GPIOx_BOP_OFFSET					0x18U;
# define GPIOx_BC_OFFSET					0x28U;
#else
// DMA
# define DMA_PARAMETER_STRUCT				dma_parameter_struct
# define dma_interrupt_flag_clear(x,y,z)
// GPIO
# define GPIOx_BOP_OFFSET					0x10U;
# define GPIOx_BC_OFFSET					0x14U;
#endif

/**
 * https://www.gd32-dmx.org/memory.html
 */
#if defined (GD32F20X) || defined (GD32F4XX)
# define SECTION_DMA_BUFFER					__attribute__ ((section (".pixel")))
#else
# define SECTION_DMA_BUFFER
#endif

namespace pixel {
static constexpr auto PORT_COUNT = __builtin_popcount(GPIO_PINx);
static_assert(PORT_COUNT <= 16, "Too many ports");
//
static uint16_t s_DmaBuffer[512 * 2 * PORT_COUNT] __attribute__ ((aligned (4))) SECTION_DMA_BUFFER;		//FIXME Use define's
static constexpr auto DMA_BUFFER_SIZE = sizeof(pixel::s_DmaBuffer) / sizeof(s_DmaBuffer[0]);
// RTZ
static const uint16_t s_GPIO_PINs[] __attribute__ ((aligned (4))) = { GPIO_PINx } ;
static const auto *s_pGPIO_PINs = reinterpret_cast<const uint32_t *>(&s_GPIO_PINs[0]);
static auto *s_pT0H = reinterpret_cast<uint32_t *>(&s_DmaBuffer[0]);
static constexpr uint32_t RTZ_TIMER_PERIOD = (0.00000125f * MASTER_TIMER_CLOCK) - 1U;
// Clock based
static constexpr auto MAX_APA102 = ((DMA_BUFFER_SIZE / 8) - 8 ) / 4;
}  // namespace pixel

static volatile bool sv_isRunning;

extern "C" {
void TIMER3_IRQHandler() { // Slave
	__DMB();
	const auto nIntFlag = TIMER_INTF(TIMER3);

	if ((nIntFlag & TIMER_INT_FLAG_CH0) == TIMER_INT_FLAG_CH0) {
		TIMER_CTL0(TIMER2) &= (~TIMER_CTL0_CEN);

		TIMER_DMAINTEN(TIMER2) &= (~TIMER_DMA_CH0D);
		TIMER_DMAINTEN(TIMER2) &= (~TIMER_DMA_CH2D);
		TIMER_DMAINTEN(TIMER2) &= (~TIMER_DMA_CH3D);

		sv_isRunning = false;

		GPIO_BC(GPIOx) = GPIO_PINx;
	#ifndef NDEBUG
		GPIO_BOP(DEBUG_CS_GPIOx) = DEBUG_CS_GPIO_PINx;
	#endif
	} else {
		assert(0);
	}

	TIMER_INTF(TIMER3) = ~nIntFlag;
	__DMB();
}
}

WS28xxMulti *WS28xxMulti::s_pThis = nullptr;

WS28xxMulti::WS28xxMulti(PixelConfiguration& pixelConfiguration): m_PixelConfiguration(pixelConfiguration) {
	DEBUG_ENTRY

	assert(s_pThis == nullptr);
	s_pThis = this;

	DEBUG_PRINTF("PORT_COUNT=%u", PORT_COUNT);

	uint32_t nLedsPerPixel;
	pixelConfiguration.Validate(nLedsPerPixel);

	const auto Type = m_PixelConfiguration.GetType();

	if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822) || (Type == pixel::Type::P9813)) {
		DEBUG_PRINTF("MAX_APA102=%u", MAX_APA102);
		if (pixelConfiguration.GetCount() > pixel::MAX_APA102) {
			pixelConfiguration.SetCount(pixel::MAX_APA102);
			pixelConfiguration.Validate(nLedsPerPixel);
			pixelConfiguration.Dump();
		}
	}

	const auto nCount = m_PixelConfiguration.GetCount();
	m_nBufSize = nCount * nLedsPerPixel;

	if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822) || (Type == pixel::Type::P9813)) {
		m_nBufSize += nCount;
		m_nBufSize += 8;
	}

	m_nBufSize *= 8;

	DEBUG_PRINTF("m_nBufSize=%u [%u]", m_nBufSize, (m_nBufSize + 1024) / 1024);
	assert(m_nBufSize <= DMA_BUFFER_SIZE);

	/**
	 * GPIO Initialization
	 */

	rcu_periph_clock_enable(RCU_GPIOx);
#if !defined (GD32F4XX)
	gpio_init(GPIOx, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, GPIO_PINx);
#else
	gpio_af_set(GPIOx, GPIO_AF_0, GPIO_PINx);
    gpio_mode_set(GPIOx, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, GPIO_PINx);
    gpio_output_options_set(GPIOx, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, GPIO_PINx);
#endif

	GPIO_BC(GPIOx) = GPIO_PINx;

#ifndef NDEBUG
	rcu_periph_clock_enable(DEBUG_CS_RCU_GPIOx);
#if !defined (GD32F4XX)
	gpio_init(DEBUG_CS_GPIOx, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, DEBUG_CS_GPIO_PINx);
#else
	gpio_af_set(DEBUG_CS_GPIOx, GPIO_AF_0, DEBUG_CS_GPIO_PINx);
    gpio_mode_set(DEBUG_CS_GPIOx, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, DEBUG_CS_GPIO_PINx);
    gpio_output_options_set(DEBUG_CS_GPIOx, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, DEBUG_CS_GPIO_PINx);
#endif

	GPIO_BOP(DEBUG_CS_GPIOx) = DEBUG_CS_GPIO_PINx;
#endif

	if (pixelConfiguration.IsRTZProtocol()) {
		Setup(pixelConfiguration.GetLowCode(), pixelConfiguration.GetHighCode());
	} else {
		Setup(pixelConfiguration.GetClockSpeedHz());
	}

	DEBUG_EXIT
}

WS28xxMulti::~WS28xxMulti() {
	DEBUG_ENTRY

	s_pThis = nullptr;

