vanvught/GD32F407RE-DMX512-RDM/lib-ws28xx/src/gpio/ws28xxmulti.cpp
	DEBUG_EXIT
}

void WS28xxMulti::Print() {
	const auto Type = m_PixelConfiguration.GetType();

	printf("Pixel\n");
	printf(" Type  : %s [%d]\n", PixelType::GetType(Type), static_cast<int>(Type));
	printf(" Count : %d\n", m_PixelConfiguration.GetCount());

	if (!m_PixelConfiguration.IsRTZProtocol()) {
		printf(" Clock : %u Hz\n", m_PixelConfiguration.GetClockSpeedHz());
	} else {
		const auto Map = m_PixelConfiguration.GetMap();
		const auto nLowCode = m_PixelConfiguration.GetLowCode();
		const auto nHighCode = m_PixelConfiguration.GetHighCode();

		printf(" Mapping : %s [%d]\n", PixelType::GetMap(Map), static_cast<int>(Map));
		printf(" T0H     : %.2f [0x%X]\n", PixelType::ConvertTxH(nLowCode), nLowCode);
		printf(" T1H     : %.2f [0x%X]\n", PixelType::ConvertTxH(nHighCode), nHighCode);
	}
}

void WS28xxMulti::Update() {
	assert(!sv_isRunning);

#ifndef NDEBUG
	GPIO_BC(DEBUG_CS_GPIOx) = DEBUG_CS_GPIO_PINx;
#endif

	sv_isRunning = true;

	TIMER_CTL0(TIMER3) &= (~TIMER_CTL0_CEN);
	TIMER_CNT(TIMER3) = 0;

	TIMER_CTL0(TIMER2) &= (~TIMER_CTL0_CEN);
	TIMER_CNT(TIMER2) = 0;

	if (m_PixelConfiguration.IsRTZProtocol()) {
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH0_DMA_CHx) &= ~DMA_CHXCTL_CHEN;
		dma_interrupt_flag_clear(TIMER2_DMAx, TIMER2_CH0_DMA_CHx, DMA_INTF_FTFIF);
		DMA_CHMADDR(TIMER2_DMAx, TIMER2_CH0_DMA_CHx) = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
		DMA_CHCNT(TIMER2_DMAx, TIMER2_CH0_DMA_CHx) = (m_nBufSize & DMA_CHXCNT_CNT);
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH0_DMA_CHx) |= DMA_CHXCTL_CHEN;

		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) &= ~DMA_CHXCTL_CHEN;
		dma_interrupt_flag_clear(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, DMA_INTF_FTFIF);
		DMA_CHMADDR(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) = reinterpret_cast<uint32_t>(pixel::s_pT0H);
		DMA_CHCNT(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) = ((m_nBufSize) & DMA_CHXCNT_CNT);
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) |= DMA_CHXCTL_CHEN;

		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) &= ~DMA_CHXCTL_CHEN;
		dma_interrupt_flag_clear(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, DMA_INTF_FTFIF);
		DMA_CHMADDR(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
		DMA_CHCNT(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) = ((m_nBufSize) & DMA_CHXCNT_CNT);
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) |= DMA_CHXCTL_CHEN;

		timer_dma_enable(TIMER2, TIMER_DMA_CH0D);
		timer_dma_enable(TIMER2, TIMER_DMA_CH2D);
		timer_dma_enable(TIMER2, TIMER_DMA_CH3D);
	} else {
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) &= ~DMA_CHXCTL_CHEN;
		dma_interrupt_flag_clear(TIMER2_DMAx, TIMER2_CH2_DMA_CHx, DMA_INTF_FTFIF);
		DMA_CHMADDR(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) = reinterpret_cast<uint32_t>(pixel::s_pGPIO_PINs);
		DMA_CHCNT(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) = (m_nBufSize & DMA_CHXCNT_CNT);
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH2_DMA_CHx) |= DMA_CHXCTL_CHEN;

		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) &= ~DMA_CHXCTL_CHEN;
		dma_interrupt_flag_clear(TIMER2_DMAx, TIMER2_CH3_DMA_CHx, DMA_INTF_FTFIF);
		DMA_CHMADDR(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) = reinterpret_cast<uint32_t>(pixel::s_DmaBuffer);
		DMA_CHCNT(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) = (m_nBufSize & DMA_CHXCNT_CNT);
		DMA_CHCTL(TIMER2_DMAx, TIMER2_CH3_DMA_CHx) |= DMA_CHXCTL_CHEN;

		timer_dma_enable(TIMER2, TIMER_DMA_CH2D);
		timer_dma_enable(TIMER2, TIMER_DMA_CH3D);
	}

	TIMER_CTL0(TIMER3) |= TIMER_CTL0_CEN;
	TIMER_CTL0(TIMER2) |= TIMER_CTL0_CEN;
}

void WS28xxMulti::Blackout() {
	DEBUG_ENTRY

	/**
	 * Can be called any time. Make sure the previous transmit is ended.
	 */

	do {
		__DMB();
	} while (sv_isRunning);

	if (m_PixelConfiguration.IsRTZProtocol()) {
		for (uint32_t i = 0; i < pixel::DMA_BUFFER_SIZE / 2; i++) {
			pixel::s_pT0H[i] = GPIO_PINx | (static_cast<uint32_t>(GPIO_PINx) << 16);
		}
	} else {
		const auto Type = m_PixelConfiguration.GetType();
		if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822) || (Type == pixel::Type::P9813)) {
			const auto nCount = m_PixelConfiguration.GetCount();
			for (auto nPortIndex = 0; nPortIndex < pixel::PORT_COUNT; nPortIndex++) {
				SetPixel4Bytes(nPortIndex, 0, 0, 0, 0, 0);

				for (uint32_t nPixelIndex = 1; nPixelIndex <= nCount; nPixelIndex++) {
					SetPixel4Bytes(nPortIndex, nPixelIndex, 0xE0, 0, 0, 0);
				}

				if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822)) {
					SetPixel4Bytes(nPortIndex, 1U + nCount, 0xFF, 0xFF, 0xFF, 0xFF);
				} else {
					SetPixel4Bytes(nPortIndex, 1U + nCount, 0, 0, 0, 0);
				}
			}
		} else {
			assert(Type == pixel::Type::WS2801);
			auto *p = reinterpret_cast<uint32_t *>(&pixel::s_DmaBuffer[0]);
			for (uint32_t i = 0; i < pixel::DMA_BUFFER_SIZE / 2; i++) {
				p[i] = 0;
			}
		}
	}

	Update();

	/**
	 * A blackout may not be interrupted.
	 */

	do {
		__DMB();
	} while (sv_isRunning);

	DEBUG_EXIT
}


void WS28xxMulti::FullOn() {
	DEBUG_ENTRY

	/**
	 * Can be called any time. Make sure the previous transmit is ended.
	 */

	do {
		__DMB();
	} while (sv_isRunning);

	if (m_PixelConfiguration.IsRTZProtocol()) {
		for (uint32_t i = 0; i < pixel::DMA_BUFFER_SIZE / 2; i++) {
			pixel::s_pT0H[i] = 0;
		}
	} else {
		const auto Type = m_PixelConfiguration.GetType();
		if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822) || (Type == pixel::Type::P9813)) {
			const auto nCount = m_PixelConfiguration.GetCount();
			for (auto nPortIndex = 0; nPortIndex < pixel::PORT_COUNT; nPortIndex++) {
				SetPixel4Bytes(nPortIndex, 0, 0, 0, 0, 0);

				for (uint32_t nPixelIndex = 1; nPixelIndex <= nCount; nPixelIndex++) {
					SetPixel4Bytes(nPortIndex, nPixelIndex, 0xE0, 0xFF, 0xFF, 0xFF);
				}

				if ((Type == pixel::Type::APA102) || (Type == pixel::Type::SK9822)) {
					SetPixel4Bytes(nPortIndex, 1U + nCount, 0xFF, 0xFF, 0xFF, 0xFF);
				} else {
					SetPixel4Bytes(nPortIndex, 1U + nCount, 0, 0, 0, 0);
				}
			}
		} else {
			assert(Type == pixel::Type::WS2801);
			auto *p = reinterpret_cast<uint32_t *>(&pixel::s_DmaBuffer[0]);
			for (uint32_t i = 0; i < pixel::DMA_BUFFER_SIZE / 2; i++) {
				p[i] = 0xFF;
			}
		}
	}

	Update();

	/**
	 * May not be interrupted.
	 */

	do {
		__DMB();
	} while (sv_isRunning);

